<?php
class Send_Bad_Request
{
    private $error_code;
    private $messages= array(
        1=>'API ارسالی با نوع API های پی لاین سازگار نمی باشد ',
        2=>'مقدار وارد شده صحیح نسیت و یا کمتر از 1000 ریال است',
        3=>'مقدار آدرس بازگشت خالی است .',
        4=>'درگاهی با درخواست ارسالی شما یافت نشد و یا در حالت انتظار است .',
        5=>'خطایی ناشناخته در هنگام دریافت پاسخ از درگاه پرداخت رخ داده است .',
        6=>'به نظر میرسد که شما کوکی های خود را از بین برده اید اگر کارت شارژ خریداری شده خود را دریافت نکردید با مدیر سایت تماس بگیرید',
        7=>'شما درخواستی غیر منطقی درون مرورگر خود وارد نموده اید اگر مشکلی فکر میکنید پیش آمده با مدیر سایت تماس بگیرید.',
        8=>'API ارسالی با API موجود در سایت پی لاین همخوانی ندار.',
        9=>'trans_id ارسالی معتبر نمی باشد.',
        10=>'id_get ارسالی معتبر نمی باشد.',
        11=>'چنین تراکنشی در سیستم موجود نمی باشد و یا موفقیت آمیز نبوده.',
        12=>'شما درخواستی نا معقول ارسال کرده اید و به نظر میرسد در حال هک کردن سایت هستید.',
        13=>'ایمیل ارسال شده شما صحیح نیست لطفا دوباره تلاش کنید.',
        14=>'فیلد ایمیل خالی رها شده لطفا ایمیل خود را بنویسید.',
        15=>'مبلغ وارد شده صحیح نیست.',
        16=>'مبلغ درخواستی برای شارژ وجود ندارد.',
        17=>'تعداد مجاز شارژ درخواستی بیشتر از حد مجاز است.',
        18=>'نوع دریافت شارژ وجود ندارد.',
        19=>'شماره موبایل وارد شده صحیح نیست.',
        20=>'شماره موبایل وارد نشده است.',
        21=>'با عرض پوزش از شما کاربر گرامی، موجودی انبار ما کمتر از تعداد درخواستی شما است.',
        22=>'با عرض معذرت خطایی در محاسبه مبلغ تراکنش رخ داده.',
        23=>'با عرض پوزش از شما کاربر گرامی، موجودی انبار ما کمتر از تعداد درخواستی شما است.',
        24=>'با عرض معذرت خطایی در محاسبه مبلغ تراکنش رخ داده.',
    );
    public function __construct($id)
    {
        $this->error_code=$id;
        //echo 'ERROOR CODE: '.$this->error_code;
    }
    /*خروجی ارسالی ماژول*/
    public function get_output()
    {
        return array('class_name'=>'send_bad_request','error_code'=>$this->error_code,'error_message'=>$this->messages[$this->error_code]);
    }
}